## Pandas

**테이블 형태의 데이터 분석**하는데 유용

#### 참고) mutable vs immutable
- mutable: list, dic, set + np.array, pd.DataFrame, tf.Tensor, torch.Tensor
- immutable: int, float, string, tuple
<hr>

```python
# immutable
a = 10  # 10 obj 1개 생성하여 a에 할당
a = 20  # 20 obj 1개 생성하여 a에 할당
a = int.__init__(10)
a = int.__init__(20)
## 메모리에 10 obj 하나를 두고 여기저기 다른 변수에 할당해줄 수 있다.
```
<hr>

```python
# mutable
L = [1, 2, 3]
L = list.__init__(1, 2, 3)
L[0] = 4
```

### 1. Pandas DataFrame and Operations

In [2]:
## 1.5.3 을 현업에서 많이 씀 >> numpy와의 연동 이슈
%pip install pandas==1.5.3

## 2.* 버전은 numpy 대신 apache arrow로 내부적 구조가 많이 바뀌었다. 대용량 데이터 처리를 위함.

Collecting pandas==1.5.3
  Downloading pandas-1.5.3-cp311-cp311-macosx_11_0_arm64.whl.metadata (11 kB)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/anaconda3/lib/python3.11/site-packages (from pandas==1.5.3) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/anaconda3/lib/python3.11/site-packages (from pandas==1.5.3) (2023.3.post1)
Requirement already satisfied: numpy>=1.21.0 in /opt/anaconda3/lib/python3.11/site-packages (from pandas==1.5.3) (1.26.4)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.11/site-packages (from python-dateutil>=2.8.1->pandas==1.5.3) (1.16.0)
Downloading pandas-1.5.3-cp311-cp311-macosx_11_0_arm64.whl (10.8 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 10.8/10.8 MB 17.2 MB/s eta 0:00:0000:010:01
Installing collected packages: pandas
  Attempting uninstall: pandas
    Found existing installation: pandas 2.1.4
    Uninstalling pandas-2.1.4:
      Successfully uninstalled pandas-2.1.4
Successfully installed pandas-1.5.3
Note: you may need to restart the kernel to use updated packages.

In [1]:
# pandas 라이브러리를 불러옵니다. pd를 약칭으로 사용합니다.
import pandas as pd
pd.__version__

'1.5.3'

- DataFrame은 2차원 테이블이고, 테이블의 한 줄(행/열)을 Series라고 합니다.


- Series의 모임이 곧, DataFrame이 됩니다.

In [ ]:
# s는 1, 3, 5, np.nan, 6, 8을 원소로 가지는 pandas.Series

In [2]:
import numpy as np

In [4]:
df = pd.DataFrame(data=np.random.randn(12,4),
                  index=np.arange(12),
                  columns=['X1', 'X2', 'X3', 'X4'])
df

          X1        X2        X3        X4
0   0.558303 -0.446177  1.433896  2.020772
1   2.374310  0.127967 -0.586974 -0.140579
2  -0.310807 -0.592321  0.856899  1.019807
3   0.465335 -0.464008 -0.890217  0.248577
4  -0.471597  0.340895  0.591409  0.229647
5   1.853493 -0.616741 -0.028571  0.453871
6   0.309837 -1.287880 -0.797997 -0.162820
7   0.686300 -0.971881  1.199031 -0.507370
8  -0.600873  0.380605 -1.047172 -0.178526
9  -0.696849 -1.101743  0.162294 -1.194662
10 -0.489967 -0.375353 -0.041432  0.132745
11  0.873225 -0.931877  1.262836 -0.318492

In [5]:
# dataframe index
df.index

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

In [6]:
# dataframe columns
df.columns

## dtype object ==> 문자열이 든 데이터 타입을 object라고 명시함

Index(['X1', 'X2', 'X3', 'X4'], dtype='object')

In [7]:
# dataframe values
df.values

## 무엇으로 DataFrame을 생성했다 한들, values로 return되는 값은 numpy.array로 반환한다.

array([[ 0.55830291, -0.44617745,  1.43389552,  2.02077175],
       [ 2.37431045,  0.12796712, -0.58697409, -0.14057866],
       [-0.31080652, -0.59232065,  0.85689921,  1.01980704],
       [ 0.46533534, -0.46400841, -0.89021689,  0.24857713],
       [-0.47159683,  0.34089536,  0.59140938,  0.22964666],
       [ 1.85349252, -0.61674148, -0.02857147,  0.45387103],
       [ 0.30983681, -1.28787989, -0.79799737, -0.16282028],
       [ 0.68630003, -0.97188083,  1.19903059, -0.50737026],
       [-0.60087318,  0.380605  , -1.04717179, -0.17852583],
       [-0.6968488 , -1.101743  ,  0.16229447, -1.19466172],
       [-0.48996718, -0.37535286, -0.04143238,  0.13274482],
       [ 0.87322492, -0.93187701,  1.26283609, -0.31849175]])

In [9]:
# 특정 column을 가져오기
df['X1']

0     0.558303
1     2.374310
2    -0.310807
3     0.465335
4    -0.471597
5     1.853493
6     0.309837
7     0.686300
8    -0.600873
9    -0.696849
10   -0.489967
11    0.873225
Name: X1, dtype: float64

In [10]:
## row는 위와 같이 index 명으로 가져올 수는 없음
df[0]

KeyError: 0

In [12]:
# X1 column에 2 더하기
df['X1'] + 2

0     2.558303
1     4.374310
2     1.689193
3     2.465335
4     1.528403
5     3.853493
6     2.309837
7     2.686300
8     1.399127
9     1.303151
10    1.510033
11    2.873225
Name: X1, dtype: float64

### 2.2. Dataframe 기초 method

In [13]:
# dataframe의 맨 위 다섯줄을 보여주는 head()
df.head()

         X1        X2        X3        X4
0  0.558303 -0.446177  1.433896  2.020772
1  2.374310  0.127967 -0.586974 -0.140579
2 -0.310807 -0.592321  0.856899  1.019807
3  0.465335 -0.464008 -0.890217  0.248577
4 -0.471597  0.340895  0.591409  0.229647

In [14]:
# 10줄
df.head(10)

         X1        X2        X3        X4
0  0.558303 -0.446177  1.433896  2.020772
1  2.374310  0.127967 -0.586974 -0.140579
2 -0.310807 -0.592321  0.856899  1.019807
3  0.465335 -0.464008 -0.890217  0.248577
4 -0.471597  0.340895  0.591409  0.229647
5  1.853493 -0.616741 -0.028571  0.453871
6  0.309837 -1.287880 -0.797997 -0.162820
7  0.686300 -0.971881  1.199031 -0.507370
8 -0.600873  0.380605 -1.047172 -0.178526
9 -0.696849 -1.101743  0.162294 -1.194662

In [19]:
# 맨 아래 다섯 줄
df.tail()

          X1        X2        X3        X4
7   0.686300 -0.971881  1.199031 -0.507370
8  -0.600873  0.380605 -1.047172 -0.178526
9  -0.696849 -1.101743  0.162294 -1.194662
10 -0.489967 -0.375353 -0.041432  0.132745
11  0.873225 -0.931877  1.262836 -0.318492

In [16]:
# dataframe에 대한 전체적인 요약정보를 보여줍니다.
# index, columns, null/not-null/dtype/memory usage가 표시됩니다.
df.info()
## non-null count: 각 column별 null이 아닌 데이터 개수
## Dtype: 각 column별 data type (문자열: object)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X1      12 non-null     float64
 1   X2      12 non-null     float64
 2   X3      12 non-null     float64
 3   X4      12 non-null     float64
dtypes: float64(4)
memory usage: 480.0 bytes

In [17]:
# dataframe에 대한 전체적인 **통계정보**를 보여줍니다.
df.describe()

              X1         X2         X3         X4
count  12.000000  12.000000  12.000000  12.000000
mean    0.379226  -0.494876   0.176167   0.133581
std     0.982137   0.548595   0.889299   0.804067
min    -0.696849  -1.287880  -1.047172  -1.194662
25%    -0.476189  -0.941878  -0.639730  -0.213517
50%     0.387586  -0.528165   0.066861  -0.003917
75%     0.733031  -0.249523   0.942432   0.299901
max     2.374310   0.380605   1.433896   2.020772

In [20]:
# 판다스는 정렬 기준의 최소 단위가 row이다.
# X2 column를 기준으로 내림차순 정렬
## ascending=True가 디폴트
df.sort_values(by='X2', ascending=False)

          X1        X2        X3        X4
6   0.309837 -1.287880 -0.797997 -0.162820
9  -0.696849 -1.101743  0.162294 -1.194662
7   0.686300 -0.971881  1.199031 -0.507370
11  0.873225 -0.931877  1.262836 -0.318492
5   1.853493 -0.616741 -0.028571  0.453871
2  -0.310807 -0.592321  0.856899  1.019807
3   0.465335 -0.464008 -0.890217  0.248577
0   0.558303 -0.446177  1.433896  2.020772
10 -0.489967 -0.375353 -0.041432  0.132745
1   2.374310  0.127967 -0.586974 -0.140579
4  -0.471597  0.340895  0.591409  0.229647
8  -0.600873  0.380605 -1.047172 -0.178526

### 2.3. Fancy Indexing !

- 데이터를 filtering <=> Search !

- 전체 데이터에서 원하는 일부의 데이터를 찾아오는 방법 !

In [21]:
# pandas dataframe은 column 이름을 이용하여 기본적인 Indexing이 가능합니다.
# X1 column을 indexing
df['X1']

0     0.558303
1     2.374310
2    -0.310807
3     0.465335
4    -0.471597
5     1.853493
6     0.309837
7     0.686300
8    -0.600873
9    -0.696849
10   -0.489967
11    0.873225
Name: X1, dtype: float64

In [22]:
# dataframe에서 slicing을 이용하면 row 단위로 잘려나옵니다.
# 앞에서 3줄을 slicing 합니다.
df[:3]

         X1        X2        X3        X4
0  0.558303 -0.446177  1.433896  2.020772
1  2.374310  0.127967 -0.586974 -0.140579
2 -0.310807 -0.592321  0.856899  1.019807

In [23]:
# df에서 index value를 기준으로 indexing도 가능합니다. (여전히 row 단위)
df.loc[0]

X1    0.558303
X2   -0.446177
X3    1.433896
X4    2.020772
Name: 0, dtype: float64

In [26]:
# df.loc는 특정값을 기준으로 indexing합니다. (key - value)
# df.loc[row, column]
df.loc[0, 'X1']

0.5583029102939046

In [28]:
# df.loc에 2차원 indexing도 가능합니다.
## 재배열도 가능. 입력한 순서대로 데이터를 재배열하여 가져옴
df.loc[[0, 3], ['X1', 'X4', 'X2']]

         X1        X4        X2
0  0.558303  2.020772 -0.446177
3  0.465335  0.248577 -0.464008

In [29]:
df.loc[3, ['X1', 'X4', 'X2']]

X1    0.465335
X4    0.248577
X2   -0.464008
Name: 3, dtype: float64

In [ ]:
df['X3'] > 0

In [34]:
# dataframe에 조건식을 적용해주면 조건에 만족하는지 여부를 알려주는 "mask"가 생깁니다.
## mask: boolean mask - filter되어 보여줌
# NOTE: boolean mask는 mask와 적용 대상의 **index가 동일**해야 함!!!!!
mask = df['X3'] > 0
mask

0      True
1     False
2      True
3     False
4      True
5     False
6     False
7      True
8     False
9      True
10    False
11     True
Name: X3, dtype: bool

In [35]:
df[mask]

          X1        X2        X3        X4
0   0.558303 -0.446177  1.433896  2.020772
2  -0.310807 -0.592321  0.856899  1.019807
4  -0.471597  0.340895  0.591409  0.229647
7   0.686300 -0.971881  1.199031 -0.507370
9  -0.696849 -1.101743  0.162294 -1.194662
11  0.873225 -0.931877  1.262836 -0.318492

In [36]:
# 1)
df[mask]['X3']

0     1.433896
2     0.856899
4     0.591409
7     1.199031
9     0.162294
11    1.262836
Name: X3, dtype: float64

In [39]:
# 2) df.loc[row에 대한 조건식, col에 대한 조건식]
## ⭐️⭐️ 판다스에서 추천하는 방식!! - 메모리 복사 등의 이유로...
df.loc[mask, 'X3']

0     1.433896
2     0.856899
4     0.591409
7     1.199031
9     0.162294
11    1.262836
Name: X3, dtype: float64

In [41]:
## Q2. df에서 X1 Column 에 있는 원소들 중 1보다 작은 원소 출력하기
df.loc[df['X1'] < 1, 'X1']

0     0.558303
2    -0.310807
3     0.465335
4    -0.471597
6     0.309837
7     0.686300
8    -0.600873
9    -0.696849
10   -0.489967
11    0.873225
Name: X1, dtype: float64

In [42]:
## Q2. df에서 X1 Column 에 있는 원소들 중 1보다 작은 원소들에 해당하는 'X2' 값 출력하기
df.loc[df['X1'] < 1, 'X2']

0    -0.446177
2    -0.592321
3    -0.464008
4     0.340895
6    -1.287880
7    -0.971881
8     0.380605
9    -1.101743
10   -0.375353
11   -0.931877
Name: X2, dtype: float64

In [43]:
## cf. List에서의 인덱싱
L = [[1,2],
     [3,4]]
L[1][1]

4

In [45]:
L[1, 1]
## [1, 1]을 튜플로 인식해서 오류남

TypeError: list indices must be integers or slices, not tuple

In [44]:
## numpy array 인덱싱
arr = np.array(L)
arr[1, 1]

4

In [46]:
# 2차원 리스트 indexing과 같은 원리가 되었습니다.
# integer-location based indexing ==> iloc
df.iloc[1, 1]

0.1279671180249976

In [47]:
# iloc로 2차원 indexing을 하게되면, row 기준으로 index 3,4를 가져오고 column 기준으로 0, 1을 가져옵니다.
df.iloc[[3,4], [0,1]]

         X1        X2
3  0.465335 -0.464008
4 -0.471597  0.340895

In [ ]:
## 전체 출력
L[:]

In [49]:
# Q. 2차원 indexing에 뒤에가 : 면 어떤 의미일까요?
## 전체 row, X4 컬럼
df.iloc[:, 3]

[[1, 2], [3, 4]]

In [50]:
## row 0, 전체 컬럼
df.iloc[0, :]

X1    0.558303
X2   -0.446177
X3    1.433896
X4    2.020772
Name: 0, dtype: float64

## 2.3. 여러 DataFrame 합치기
* JOIN Operation

In [69]:
## dictionary로 DataFrame 생성
# key - column 이름
# value - 데이터
# index - row 이름
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                   index=[8, 9, 10, 11])

In [52]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [70]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [54]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [55]:
# 위-아래로 합치기
## default: axis=0 컬럼을 기준으로 합침
## pd.concat([df, ..., df])
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [56]:
# 가로 방향으로 합치기
## index를 기준으로 합친다.
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [71]:
# 기존의 index를 reset_index() 함수를 통해 초기화한다.
df2.reset_index()

   index   A   B   C   D
0      4  A4  B4  C4  D4
1      5  A5  B5  C5  D5
2      6  A6  B6  C6  D6
3      7  A7  B7  C7  D7

In [73]:
# VIEW
# 기존의 index는 drop 시켜 안 보이게 함!
df2.reset_index(drop=True)

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [75]:
# 그냥 합치기 (concatenation)
pd.concat([df1, df2.reset_index(drop=True), df3.reset_index(drop=True)], axis=1)

    A   B   C   D   A   B   C   D    A    B    C    D
0  A0  B0  C0  D0  A4  B4  C4  D4   A8   B8   C8   D8
1  A1  B1  C1  D1  A5  B5  C5  D5   A9   B9   C9   D9
2  A2  B2  C2  D2  A6  B6  C6  D6  A10  B10  C10  D10
3  A3  B3  C3  D3  A7  B7  C7  D7  A11  B11  C11  D11

In [77]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']})

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A1', 'A2'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']})

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C6', 'C7', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']})

In [78]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [79]:
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A1  B6  C6  D6
3  A2  B7  C7  D7

In [80]:
df3

     A    B    C    D
0   A8   B8   C6   D8
1   A9   B9   C7   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

## JOIN 연산 ⭐️⭐️⭐️

In [81]:
# SQL과 같이 join operation을 사용할 수 있다.
## A inner join B (테이블 A와 테이블 B의 겹치는 값들을 기준으로 테이블을 합치는 연산)
pd.merge(left=df1,
         right=df2,
         on='A',
         how='inner')

    A B_x C_x D_x B_y C_y D_y
0  A1  B1  C1  D1  B6  C6  D6
1  A2  B2  C2  D2  B7  C7  D7

In [85]:
## df2 inner join df3 : column C
pd.merge(df2, df3, on='C', how='inner')

  A_x B_x   C D_x A_y B_y D_y
0  A1  B6  C6  D6  A8  B8  D8
1  A2  B7  C7  D7  A9  B9  D9

In [87]:
## 기준 컬럼으로 인덱싱 새로 하기
pd.merge(df2, df3, on='C', how='inner')[['C', 'A_x', 'B_x', 'D_x', 'A_y', 'B_y', 'D_y']]

    C A_x B_x D_x A_y B_y D_y
0  C6  A1  B6  D6  A8  B8  D8
1  C7  A2  B7  D7  A9  B9  D9

In [ ]:
## [ ] SQL로 하기

In [86]:
# left join
## left tbl을 기준으로 rigth tbl에서 on에 대해 겹치는 대상을 붙임.
## 겹치지 않는 데이터는 NaN
pd.merge(df1, df2, on='A', how='left')

    A B_x C_x D_x  B_y  C_y  D_y
0  A0  B0  C0  D0  NaN  NaN  NaN
1  A1  B1  C1  D1   B6   C6   D6
2  A2  B2  C2  D2   B7   C7   D7
3  A3  B3  C3  D3  NaN  NaN  NaN

## 2.4 DataFrame으로 데이터 불러오기


Source : https://www.kaggle.com/c/titanic/data

In [88]:
# train.csv 파일 불러오기
titanic = pd.read_csv('./data/train.csv')
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [91]:
# Q1. 여성 승객들의 평균 나이
titanic[titanic['Sex'] == 'female']['Age'].mean()

27.915708812260537

In [92]:
titanic.loc[titanic['Sex'] == 'female', 'Age'].mean()

27.915708812260537

In [93]:
np.mean(titanic.loc[titanic['Sex'] == 'female', 'Age'])

27.915708812260537

In [102]:
# Q2. 1등석에 탑승한 승객 중 최대 요금을 낸 사람의 이름
titanic.loc[titanic['Fare'] == titanic.loc[titanic['Pclass'] == 1, 'Fare'].max(), 'Name']

258                      Ward, Miss. Anna
679    Cardeza, Mr. Thomas Drake Martinez
737                Lesurer, Mr. Gustave J
Name: Name, dtype: object

In [108]:
temp = titanic.loc[titanic['Pclass'] == 1, ['Name', 'Fare']]
temp.loc[temp['Fare'] == temp['Fare'].max(), 'Name']

258                      Ward, Miss. Anna
679    Cardeza, Mr. Thomas Drake Martinez
737                Lesurer, Mr. Gustave J
Name: Name, dtype: object

In [121]:
# Q3. 1등석에 탑승한 승객 중 승선한 항구port of embarked 가 Queenstown(Q)인 사람들의 수는?
temp2 = titanic[titanic['Pclass'] == 1]
temp2[temp2['Embarked'] == 'Q']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
245,246,0,1,"Minahan, Dr. William Edward",male,44.0,2,0,19928,90.0,C78,Q
412,413,1,1,"Minahan, Miss. Daisy E",female,33.0,1,0,19928,90.0,C78,Q

mask & mask : 조건을 둘 다 만족하는 mask (AND)

mask | mask : 조건 중 하나 이상 만족하는 mask (OR)

~mask : 조건 반전. 조건이 아닌 것. (NOT)

In [134]:
titanic[(titanic['Pclass'] == 1) & (titanic['Embarked'] == 'Q')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
245,246,0,1,"Minahan, Dr. William Edward",male,44.0,2,0,19928,90.0,C78,Q
412,413,1,1,"Minahan, Miss. Daisy E",female,33.0,1,0,19928,90.0,C78,Q

In [133]:
## shape[0]: row
## shape[1]: column
titanic[(titanic['Pclass'] == 1) & (titanic['Embarked'] == 'Q')].shape[0]

2

In [135]:
titanic[(titanic['Pclass'] == 1) & (titanic['Embarked'] == 'Q')].count()

PassengerId    2
Survived       2
Pclass         2
Name           2
Sex            2
Age            2
SibSp          2
Parch          2
Ticket         2
Fare           2
Cabin          2
Embarked       2
dtype: int64

In [136]:
len(titanic[(titanic['Pclass'] == 1) & (titanic['Embarked'] == 'Q')])

2

.isin(['S', 'Q'])

In [139]:
# Q4. 승선한 곳이 "S"인 사람들의 생존자 수는?
## 👀 Survived 는 int값 0, 1 으로 나타나므로, 이를 다 합산sum하면 결국 Survived인 사람의 수가 되는 것!
titanic.loc[titanic['Embarked'].isin(['S']), 'Survived'].sum()

217

In [142]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

문자열 함수 >> DataFrame.str.~~

In [145]:
# Q5. 미혼 여성 중에 나이를 모르는 사람의 수는?
## Sex == female이며 Name에 Miss가 포함된 사람 수를 구하면 됨

## isna() 와 isnull()
# NOTE: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.isnull.html#pandas.DataFrame.isnull
# 공식 문서에서 isna()와 isnull()이 서로의 alias라고 표현하고 있음


## True, False를 연산을 하게 되면 1, 0으로 계산되기 때문에 합산sum()으로 구하면 됨!
titanic.loc[titanic['Name'].str.contains("Miss."), 'Age'].isnull().sum()

36

## 2.5. Pivot Table을 이용하여 데이터 살펴보기

- pivot table이란 기존 테이블 구조를 특정 column을 기준으로 재구조화한 테이블을 말합니다.

- 특정 column을 기준으로 pivot하기 때문에, 어떤 column에 어떤 연산을 하느냐에 따라서 만들어지는 결과가 바뀝니다.

- 주로 어떤 column을 기준으로 데이터를 해석하고 싶을 때 사용합니다.

In [ ]:
# 성별을 기준으로 생존률 파악 --> Mean vs Sum

In [ ]:
# 사회 계급을 기준으로 생존률 파악